#merge
import pandas as pd

df1 = pd.DataFrame({'고객번호': [1001, 1002, 1003, 1004, 1005, 1006], '이름':['감강찬','이순신','장보고','유관순','신사임당','세종대왕']}, columns=['고객번호', '이름'])
print('[데이터프레임 1]')
print(df1)

print('-'*70)
print("")

df2 = pd.DataFrame({'고객번호': [1001, 1001, 1005, 1006, 1008, 1001], '금액':[10000,20000,15000,5000,100000,30000]}, columns=['고객번호', '금액'])
print('[데이터프레임 2]')
print(df2)

print('-'*70)
print("")
print("[ Merge inner join 무결성 확보]")
df3 = pd.merge(df1,df2, how='inner', on='고객번호')
print(df3)

print('-'*70)
print("")
print("[ Merge outer join 최대한 많은 데이터 확보]")
df4 = pd.merge(df1,df2, how='outer')
print(df4)

'''
결과
   고객번호    이름
0  1001   감강찬
1  1002   이순신
2  1003   장보고
3  1004   유관순
4  1005  신사임당
5  1006  세종대왕
----------------------------------------------------------------------

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000
----------------------------------------------------------------------

   고객번호    이름     금액
0  1001   감강찬  10000
1  1001   감강찬  20000
2  1001   감강찬  30000
3  1005  신사임당  15000
4  1006  세종대왕   5000
----------------------------------------------------------------------

   고객번호    이름        금액
0  1001   감강찬   10000.0
1  1001   감강찬   20000.0
2  1001   감강찬   30000.0
3  1002   이순신       NaN
4  1003   장보고       NaN
5  1004   유관순       NaN
6  1005  신사임당   15000.0
7  1006  세종대왕    5000.0
8  1008   NaN  100000.0
'''